myblog/app/controllers/comments_controller.rb

SELECT * FROM `comments`
---
  def index
    @comments = Comment.all

SELECT * FROM `comments` WHERE (`comments`.`id` = 6)
---
  def show
    @comment = Comment.find(params[:id])

SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
INSERT INTO `comments` (`name`, `updated_at`, `body`, `post_id`, `created_at`) VALUES('rahul', '2010-07-01 10:07:50', '', 1, '2010-07-01 10:07:50')
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create!(params[:comment])

SELECT * FROM `comments` WHERE (`comments`.`id` = 6)
DELETE FROM `comments` WHERE `id` = 6
---
  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy